app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "location", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@user = User.create(user_params)

UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "green"], ["updated_at", "2015-09-17 15:47:07.480678"], ["id", 4]]
---
  def update
  	@user.update(user_params)

INSERT INTO "relationships" ("follower_id", "followed_id") VALUES (?, ?)  [["follower_id", 2], ["followed_id", 1]]
---
  def follow
    Relationship.create(follower_id: current_user.id, followed_id: @user.id )

SELECT  "users".* FROM "users" WHERE (lower(username) = 'test')  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
---
  def set_user
  	begin
      if params[:username]
        username = params[:username]
        @user = User.where('lower(username) = ?', username.downcase).first
        unless @user
          flash[:notice] = "That user could not be found."
          redirect_to users_path
        end
      else
        @user = User.find(params[:id])